vertical-pod-autoscaler/experiments/sn-pbr-throughput/9minus/user.log
Running 15m test @ http://10.104.194.122:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 28.457ms, rate sampling interval: 93ms
  Thread calibration: mean lat.: 26.593ms, rate sampling interval: 79ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.06s    15.56s   35.39s    70.50%
    Req/Sec    14.29     12.98    51.00     58.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  592.90ms
 75.000%   31.16s 
 90.000%   32.96s 
 99.000%   35.39s 
 99.900%   37.39s 
 99.990%   38.11s 
 99.999%   38.14s 
100.000%   38.14s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.787     0.000000            1         1.00
      58.431     0.100000         2607         1.11
     119.103     0.200000         5213         1.25
     194.303     0.300000         7820         1.43
     304.895     0.400000        10426         1.67
     592.895     0.500000        13033         2.00
   27721.727     0.550000        14347         2.22
   29130.751     0.600000        15660         2.50
   29884.415     0.650000        16960         2.86
   30556.159     0.700000        18247         3.33
   31162.367     0.750000        19574         4.00
   31457.279     0.775000        20211         4.44
   31768.575     0.800000        20874         5.00
   32047.103     0.825000        21512         5.71
   32325.631     0.850000        22171         6.67
   32669.695     0.875000        22827         8.00
   32817.151     0.887500        23140         8.89
   32964.607     0.900000        23458        10.00
   33144.831     0.912500        23805        11.43
   33325.055     0.925000        24115        13.33
   33554.431     0.937500        24454        16.00
   33718.271     0.943750        24629        17.78
   33882.111     0.950000        24793        20.00
   34013.183     0.956250        24924        22.86
   34209.791     0.962500        25098        26.67
   34406.399     0.968750        25266        32.00
   34537.471     0.971875        25343        35.56
   34701.311     0.975000        25433        40.00
   34799.615     0.978125        25507        45.71
   34897.919     0.981250        25583        53.33
   35061.759     0.984375        25668        64.00
   35127.295     0.985938        25701        71.11
   35225.599     0.987500        25744        80.00
   35323.903     0.989062        25790        91.43
   35454.975     0.990625        25834       106.67
   35586.047     0.992188        25867       128.00
   35651.583     0.992969        25882       142.22
   35880.959     0.993750        25903       160.00
   36044.799     0.994531        25922       182.86
   36208.639     0.995313        25943       213.33
   36470.783     0.996094        25968       256.00
   36503.551     0.996484        25973       284.44
   36569.087     0.996875        25986       320.00
   36634.623     0.997266        25998       365.71
   36667.391     0.997656        26003       426.67
   36798.463     0.998047        26016       512.00
   36863.999     0.998242        26019       568.89
   36929.535     0.998437        26024       640.00
   37093.375     0.998633        26029       731.43
   37191.679     0.998828        26034       853.33
   37519.359     0.999023        26039      1024.00
   37584.895     0.999121        26043      1137.78
   37650.431     0.999219        26044      1280.00
   37781.503     0.999316        26050      1462.86
   37781.503     0.999414        26050      1706.67
   37814.271     0.999512        26052      2048.00
   37945.343     0.999561        26054      2275.56
   37945.343     0.999609        26054      2560.00
   37978.111     0.999658        26056      2925.71
   38010.879     0.999707        26060      3413.33
   38010.879     0.999756        26060      4096.00
   38010.879     0.999780        26060      4551.11
   38010.879     0.999805        26060      5120.00
   38010.879     0.999829        26060      5851.43
   38109.183     0.999854        26063      6826.67
   38109.183     0.999878        26063      8192.00
   38109.183     0.999890        26063      9102.22
   38109.183     0.999902        26063     10240.00
   38109.183     0.999915        26063     11702.86
   38109.183     0.999927        26063     13653.33
   38109.183     0.999939        26063     16384.00
   38109.183     0.999945        26063     18204.44
   38109.183     0.999951        26063     20480.00
   38109.183     0.999957        26063     23405.71
   38141.951     0.999963        26064     27306.67
   38141.951     1.000000        26064          inf
#[Mean    =    15063.647, StdDeviation   =    15556.153]
#[Max     =    38109.184, Total count    =        26064]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26383 requests in 15.00m, 344.32MB read
  Socket errors: connect 0, read 1, write 9, timeout 0
Requests/sec:     29.31
Transfer/sec:    391.74KB